'use strict';
exports.createDoc = function(params) {
    let snh48 = "./app/images/snh.jpg";
    let qrcode = "./app/images/qrcode.png";
    let contractDoc = {
        content: [{
                stack: [
                    { text: '我怕明天的祝福太多，就提前祝你奇迹暖暖吧', style: 'title' },
                    {
                        text: '小泽是学长（原创）',
                        style: 'text_comment'
                    }
                ],
                style: 'header'
            },
            {
                stack: [
                    '前段时间，第一批90后被“佛系”了。\n',
                    '我是很懒得蹭这种热点的，也不太喜欢被代表，但是最近和一堆朋友唠嗑。\n',
                    '他们似乎都陷入到了佛系考研的境地。\n',
                    '大有视死如归、任你时间紧迫浑然不觉的贤者模式味道。\n'
                ],
                style: 'text_para'
            },
            {
                stack: [
                    '各位别急着灭灯，第一位登场的男嘉宾叫鹤鹤。\n',
                    '口头禅忘不了初恋，记不住重点。\n',
                    '离考研还有十天，鹤鹤还在看《亮剑》。\n',
                    '他说，李云龙攻打平安县城这个片段太特喵经典了，也就看了十来遍。\n',
                    '左一口李云龙，右一口梁欢秀。\n',
                    '二营长，你他娘不能有了意大利炮就忘了冲锋精神啊。\n',
                    '我能说啥，鼻毛都长得像吴彦祖，你帅你任性。\n'
                ],
                style: 'text_para'
            },
            {
                stack: [{
                    text: ['还有一个从小玩到大的96小朋友，前几天哭着跟我说：\n',
                        '我鞠要离开SNH48了， 考研都没动力了。\n',
                        '大晚上盯着小姐姐退团撕逼， 熬了考研来第一个通宵。 \n'
                    ]
                }, {
                    image: snh48,
                    width: 300,
                    margin: [0, 10, 0, 10]
                }, {
                    text: ['据说这厮之所以要考到上海，就是幻想日常围观【生男孩48】的大白腿。\n',
                        '读研期间有幸去小姐姐公司当保安，就是祖坟冒烟谢天谢地了。\n',
                        '我鄙夷道，你怎么这么油腻，做一个佛系的95后不好吗？\n',
                        '不就脱个团吗？又不是脱单。\n',
                        '给他发了一首摇滚版的《大悲咒》洗洗精虫入脑的病\n'
                    ]
                }],
                style: 'text_para'
            },
            {
                stack: [
                    '上次提到的17岁的艺考小姑凉，前两天扛着一把吉他。\n',
                    '跟着一堆朋友在西安街头唱《成都》，两头不讨好。\n',
                    '离艺考才两周了还在放飞自我。\n',
                    '还气愤地跟我说，现在知乎上怎么全是微商啊。\n',
                    '看了一天的减肥健身的帖子，真是闹心。\n',
                    '加了一堆模范减肥人士，不是想草粉就是来骗钱的。\n',
                    '哼，一百来斤的小破孩，婴儿肥有啥好减的。\n',
                    '现在减十斤，往后得吃多少胶原蛋白才能补回来。\n',
                    '这不，三两句油嘴滑舌，加一勺真心实意。\n',
                    '继续美滋滋地拿着橘子胖乎乎地背书去了。\n'
                ],
                style: 'text_para'
            },
            {
                stack: [
                    '一个考研的学妹上一周跟我说，最近心神不宁。\n',
                    '做梦都在晒衣服，还是我从上海空运回来的。\n',
                    '我我我，这么超现实的梦境怕不是昨天看了《木星之卫》。\n',
                    '我一边安慰她，放心我穷没这么多衣服，有也不敢使唤您啊。\n',
                    '一边翻周公解梦，告诉她这是吉兆，比转发什么锦鲤要牛逼哄哄多了。\n',
                    '最后不忘叮嘱她最近武汉比较冷，小仙女记得以凡人的标准添加衣物\n'
                ],
                style: 'text_para'
            },
            {
                stack: [
                    '还有一个朋友，周末就要去见丈母娘了。\n',
                    '特喵地每天继续吃鸡打游戏，王者玩得贼菜，还老选孙尚香。\n',
                    '人越是到关键时刻，越是容易松一口气。\n',
                    '这不是佛系，这是人性。\n',
                    '既不值得鼓励，也不值得丧到谷底。\n',
                    '劳逸结合和男女搭配永远是不变的法则。\n',
                    '既不需要有一种偷情般的罪恶感，也没必要一根筋撒手不管走到底。\n'
                ],
                style: 'text_para'
            },
            {
                stack: [
                    '最近每天都他妈是元气满满的一天啊，搞什么佛系考研。\n',
                    '考研前夕激动而刺激分泌的肾上腺素，足够上考场了。\n',
                    '我不会那么博爱地祝所有考生考试大捷，这既不现实，也无意义。\n',
                    '我只是自私地希望认识的朋友们：\n',
                    '问心无愧，从容不迫，不骄不躁，正常发挥。\n',
                    '考完来上海跨年，当面撕逼聊骚啊。\n'
                ],
                style: 'text_para'
            },
            {
                stack: [{
                        image: qrcode,
                        width: 100,
                        alignment: 'center'
                    },
                    { text: '微信扫一扫\n', style: 'text_tips' },
                    { text: '关注该公众号', style: 'text_tips' },
                ],
                style: 'text_para'
            }

        ],
        styles: {
            header: {
                margin: [0, 0, 0, 20]
            },
            title: {
                fontSize: 16,
                bold: true,
                alignment: 'center',
                color: '#333',
                margin: [0, 0, 0, 10]
            },
            text_para: {
                fontSize: 13,
                margin: [10, 0, 10, 15]
            },
            text_comment: {
                fontSize: 12,
                alignment: 'right',
            },
            text_tips: {
                fontSize: 10,
                alignment: 'center'
            }
        },
        defaultStyle: {
            font: 'msyh',
            fontSize: 12,
            color: '#2F2F2F'
        }
    }
    return contractDoc;
}